const messageConfig = [
  {
    time: '00 09 * * 1-5', // 9:00 ранку кожного робочого дня
    groupChatId: '120363371182644863@g.us',
    message: 'Доброго ранку! 🌅 Бажаємо гарного початку дня!',
  },
  {
    time: '00 13 * * 1-5', // 15:00 кожного робочого дня
    groupChatId: '120363371182644863@g.us',
    message: 'Доброго дня! 😊 Не забудьте подати ваші заявки.',
  },
  {
    time: '14 19 * * 1-5', // 20:00 кожного робочого дня
    groupChatId: '120363371182644863@g.us',
    message: 'Доброї ночі! 🌙 Сподіваємось, ваш день був продуктивним!',
  },
];

module.exports = messageConfig;
